# Two SQLite exercises
Modified from: https://medium.com/analytics-vidhya/free-sql-exercise-real-interview-questions-with-data-set-and-answer-salesforce-medium-a3bd3f853808

In [55]:
# Install pandasql with upgrade (-u) if necessary
#!pip install -U pandasql

In [3]:
# Import libraries
import pandas as pd
import pandasql as ps

## Task 1

Load the table with the new products of several car companies with their product names in 2019 and 2020 from file. Output the company name, and the net amount of new products of each company in 2020 over the amount of that in the previous year.

In [4]:
# Load data:
file_location = "Data/Salesforce.xlsx"
# Load table from file
car_launches = pd.read_excel(file_location, sheet_name = "car_launches")
# Get expected output from the same file
expected_output = pd.read_excel(file_location, sheet_name = "expected_output")

In [58]:
# Display the first five rows of the table:
car_launches.head()

   year company_name product_name
0  2020        Honda        Pilot
1  2020        Tesla      Model S
2  2020    Chevrolet       Blazer
3  2020        Tesla      Model X
4  2020    Chevrolet         Trax

# Expected Output

In [59]:
# Display the first five rows of the result table:
expected_output.head()

  Company_name  diff
0        Tesla     3
1    Chevrolet     2
2         Jeep     1
3       Toyota    -1
4         Ford    -1

In [60]:
# SQL basic query example:
ps.sqldf(
    """
    SELECT * 
    FROM expected_output
    LIMIT 5
    """
)

  Company_name  diff
0        Tesla     3
1    Chevrolet     2
2         Jeep     1
3       Toyota    -1
4         Ford    -1

## Answer

In [61]:
ps.sqldf(
    """
    SELECT Company_name, COUNT(CASE WHEN year=2020 THEN year END) - COUNT(CASE WHEN year=2019 THEN year END) as difference
    FROM car_launches
    GROUP BY Company_name
    ORDER BY difference DESC
    """
).head()

  company_name  difference
0        Tesla           3
1    Chevrolet           2
2         Jeep           1
3       Toyota          -1
4         Ford          -1

## Task 2
Find the staff with the highest target number and also works under manager id 1. Output the first name, surname, and target he has achieved.

In [62]:
# Load data:
# Load table from the same file different sheet
salesforce_employees = pd.read_excel(file_location, sheet_name = "salesforce_employees")
# Get expected output from the same file
expected_output2 = pd.read_excel(file_location, sheet_name = "expected_output2")

In [63]:
# Display the first five rows of the table:
salesforce_employees.head()

,id,first_name,last_name,age,sex,employee_title,department,salary,target,bonus,email,city,address,manager_id
0,11,Lorentz,Yeung,49,M,Manager,Management,260000,500,300,Richerd@company.com,Alabama,NaN,1
1,7,Bat,Nicky,81,F,Sales,Sales,1400,400,100,Molly@company.com,Arizona,3461 Preston Street,13
2,21,Lee,Suzan,73,F,Sales,Sales,1300,200,150,Suzan@company.com,Florida,1275 Monroe Avenue,19
3,12,Shandler,Bing,35,M,Auditor,Management,1100,200,150,Shandler@company.com,Arizona,NaN,11
4,20,Bicky,Sarrah,13,F,Senior Sales,Sales,2000,200,150,Sarrah@company.com,Florida,1176 Tyler Avenue,19

In [64]:
# SQL basic query example:
ps.sqldf(
    """
    SELECT * 
    FROM expected_output2
    LIMIT 5
    """
)

  first_name last_name  target
0    Lorentz     Yeung     500

## Answer

In [65]:
# Version 1:
ps.sqldf(
    """
    SELECT first_name,last_name, MAX(target) as max_target FROM salesforce_employees
    WHERE manager_id LIKE '1'
    """
    ).head()

  first_name last_name  max_target
0    Lorentz     Yeung         500

In [66]:
# Version 2 with subquery:
ps.sqldf(
    """
    SELECT first_name,last_name,target as max_target FROM salesforce_employees
    WHERE manager_id LIKE '1' AND target=(SELECT MAX(target) FROM salesforce_employees)
    """
    ).head()

  first_name last_name  max_target
0    Lorentz     Yeung         500